CTOS-ISEN/BLE_test/tp_ble/STM32_WPAN/App/custom_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    App/custom_app.c
  * @author  MCD Application Team
  * @brief   Custom Example Application (Server)
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble.h"
#include "custom_app.h"
#include "custom_stm.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  /* first_service */
  uint8_t               Sc_Notification_Status;
  /* echo_service */
  uint8_t               Ecc_Notification_Status;
  /* USER CODE BEGIN CUSTOM_APP_Context_t */
  // +BCH
  uint8_t 				sc_status;
  uint16_t 				cpt;
  /* USER CODE END CUSTOM_APP_Context_t */

  uint16_t              ConnectionHandle;
} Custom_App_Context_t;

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

static Custom_App_Context_t Custom_App_Context;

/**
 * END of Section BLE_APP_CONTEXT
 */

uint8_t UpdateCharData[247];
uint8_t NotifyCharData[247];

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* first_service */
static void Custom_Sc_Update_Char(void);
static void Custom_Sc_Send_Notification(void);
/* echo_service */
static void Custom_Ecc_Update_Char(void);
static void Custom_Ecc_Send_Notification(void);

/* USER CODE BEGIN PFP */
// +BCH
static void Custom_Ledc_Update_Char();
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void Custom_STM_App_Notification(Custom_STM_App_Notification_evt_t *pNotification)
{
	  /* USER CODE BEGIN CUSTOM_STM_App_Notification_1 */
		// copy data update buffer +BCH
		memcpy(UpdateCharData,pNotification->DataTransfered.pPayload,pNotification->DataTransfered.Length);
	  /* USER CODE END CUSTOM_STM_App_Notification_1 */
	  switch (pNotification->Custom_Evt_Opcode)
	  {
	    /* USER CODE BEGIN CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

	    /* USER CODE END CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

	    /* First_service */
	    case CUSTOM_STM_LC_READ_EVT:
	      /* USER CODE BEGIN CUSTOM_STM_LEDC_READ_EVT */

	      /* USER CODE END CUSTOM_STM_LEDC_READ_EVT */
	      break;

	    case CUSTOM_STM_LC_WRITE_NO_RESP_EVT:
	      /* USER CODE BEGIN CUSTOM_STM_LEDC_WRITE_NO_RESP_EVT */
	    	// +BCH
	    	Custom_Ledc_Update_Char();
	      /* USER CODE END CUSTOM_STM_LEDC_WRITE_NO_RESP_EVT */
	      break;

	    case CUSTOM_STM_SC_NOTIFY_ENABLED_EVT:
	      /* USER CODE BEGIN CUSTOM_STM_SC_NOTIFY_ENABLED_EVT */
	    	// +BCH
	    	Custom_App_Context.Sc_Notification_Status = 1;        /* My_Switch_Char notification status has been enabled */
	    	Custom_Sc_Send_Notification();
	      /* USER CODE END CUSTOM_STM_SC_NOTIFY_ENABLED_EVT */
	      break;

	    case CUSTOM_STM_SC_NOTIFY_DISABLED_EVT:
	      /* USER CODE BEGIN CUSTOM_STM_SC_NOTIFY_DISABLED_EVT */
	    	// +BCH
	    	Custom_App_Context.Sc_Notification_Status = 0;         /* My_Switch_Char notification status has been disabled */
	      /* USER CODE END CUSTOM_STM_SC_NOTIFY_DISABLED_EVT */
	      break;

	    /* echo_service */
	    case CUSTOM_STM_ECC_NOTIFY_ENABLED_EVT:
	      /* USER CODE BEGIN CUSTOM_STM_EC_NOTIFY_ENABLED_EVT */

	      /* USER CODE END CUSTOM_STM_EC_NOTIFY_ENABLED_EVT */
	      break;

	    case CUSTOM_STM_ECC_NOTIFY_DISABLED_EVT:
	      /* USER CODE BEGIN CUSTOM_STM_EC_NOTIFY_DISABLED_EVT */

	      /* USER CODE END CUSTOM_STM_EC_NOTIFY_DISABLED_EVT */
	      break;

	    default:
	      /* USER CODE BEGIN CUSTOM_STM_App_Notification_default */

	      /* USER CODE END CUSTOM_STM_App_Notification_default */
	      break;
	  }
	  /* USER CODE BEGIN CUSTOM_STM_App_Notification_2 */

	  /* USER CODE END CUSTOM_STM_App_Notification_2 */
	  return;
}

void Custom_APP_Notification(Custom_App_ConnHandle_Not_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_APP_Notification_1 */

  /* USER CODE END CUSTOM_APP_Notification_1 */

  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_APP_Notification_Custom_Evt_Opcode */

    /* USER CODE END P2PS_CUSTOM_Notification_Custom_Evt_Opcode */
    case CUSTOM_CONN_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_CONN_HANDLE_EVT */

      /* USER CODE END CUSTOM_CONN_HANDLE_EVT */
      break;

    case CUSTOM_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_DISCON_HANDLE_EVT */

      /* USER CODE END CUSTOM_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_APP_Notification_default */

      /* USER CODE END CUSTOM_APP_Notification_default */
      break;
  }

  /* USER CODE BEGIN CUSTOM_APP_Notification_2 */

  /* USER CODE END CUSTOM_APP_Notification_2 */

  return;
}

void Custom_APP_Init(void)
{
  /* USER CODE BEGIN CUSTOM_APP_Init */

  /* USER CODE END CUSTOM_APP_Init */
  return;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/* first_service */
void Custom_Sc_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Sc_UC_1*/

  /* USER CODE END Sc_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SC, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Sc_UC_Last*/

  /* USER CODE END Sc_UC_Last*/
  return;
}

void Custom_Sc_Send_Notification(void) /* Property Notification */
{
	  uint8_t updateflag = 0;

	  /* USER CODE BEGIN Sc_NS_1*/
	  	// +BCH
	  	if (Custom_App_Context.Sc_Notification_Status == 1)
		{
		  updateflag = 1;

		  if(Custom_App_Context.sc_status == 3)
		  {
			  Custom_App_Context.cpt++;
			  memcpy(&NotifyCharData[0],&Custom_App_Context.cpt,sizeof(Custom_App_Context.cpt));
			  APP_DBG_MSG("-- CUSTOM APPLICATION SERVER  : INFORM CLIENT BUTTON 3 PUSHED \n");
		  }
		}
		else
		{
		  APP_DBG_MSG("-- CUSTOM APPLICATION : CAN'T INFORM CLIENT -  NOTIFICATION DISABLED\n");
		}
	  /* USER CODE END Sc_NS_1*/

	  if (updateflag != 0)
	  {
	    Custom_STM_App_Update_Char(CUSTOM_STM_SC, (uint8_t *)NotifyCharData);
	  }

	  /* USER CODE BEGIN Sc_NS_Last*/

	  /* USER CODE END Sc_NS_Last*/

	  return;
}

/* echo_service */
void Custom_Ecc_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Ecc_UC_1*/

  /* USER CODE END Ecc_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_ECC, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Ecc_UC_Last*/

  /* USER CODE END Ecc_UC_Last*/
  return;
}

void Custom_Ecc_Send_Notification(void) /* Property Notification */
{
	  uint8_t updateflag = 0;

	  /* USER CODE BEGIN Ec_NS_1*/
	  // +BCH
	    if (Custom_App_Context.Sc_Notification_Status == 1)
	  	{
	  	  updateflag = 1;

	  	  if(Custom_App_Context.sc_status == 1)
	  	  {
	  		  memcpy(&NotifyCharData[0],&Custom_App_Context.cpt,sizeof(Custom_App_Context.cpt));
	  		  APP_DBG_MSG("-- CUSTOM APPLICATION SERVER  : INFORM CLIENT BUTTON 1 PUSHED \n");
	  	  }
	  	}
	  	else
	  	{
	  	  APP_DBG_MSG("-- CUSTOM APPLICATION : CAN'T INFORM CLIENT -  NOTIFICATION DISABLED\n");
	  	}
	  /* USER CODE END Ec_NS_1*/

	  if (updateflag != 0)
	  {
	    Custom_STM_App_Update_Char(CUSTOM_STM_ECC, (uint8_t *)NotifyCharData);
	  }

	  /* USER CODE BEGIN Ec_NS_Last*/

	  /* USER CODE END Ec_NS_Last*/

	  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/
// +BCH
void Custom_Ledc_Update_Char() /* Property writed */
{
  Custom_STM_App_Update_Char(CUSTOM_STM_LC, (uint8_t *)UpdateCharData);
  return;
}
/* USER CODE END FD_LOCAL_FUNCTIONS*/
